pascal-4.0/tutorials/multiPhysics/pimpleEddyCurrentFoam/tubafSi2Daxi/constant/extrudeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mesh_Y 1e-2;

// ************************************************************************* //

extrudeModel    linearNormal;

linearNormalCoeffs
{
    thickness   $mesh_Y;
}

nLayers         1;

constructFrom   patch;

sourceCase      ".";

sourcePatch     "front";

flipNormals     yes;

mergeFaces      off;

// ************************************************************************* //
