pascal-4.0/tutorials/multiPhysics/pimpleEddyCurrentFoam/tubafSi2Daxi/system/setSetBatch
# All

cellSet  cellSet_all                                                  new    
cellSet  cellSet_all                                                  invert 

# Bodies

pointSet pointSet_body_heater                                         new    surfaceToPoint "constant/triSurface/geometry_body_heater.stl" 0.0002 true false
cellSet  cellSet_body_heater                                          new    pointToCell pointSet_body_heater all
pointSet pointSet_body_heater                                         remove 

pointSet pointSet_body_all                                            new    surfaceToPoint "constant/triSurface/geometry_body_all.stl" 0.0002 true false
cellSet  cellSet_body_all                                             new    pointToCell pointSet_body_all all
pointSet pointSet_body_all                                            remove 

pointSet pointSet_body_conductor                                      new    surfaceToPoint "constant/triSurface/geometry_body_conductor.stl" 0.0002 true false
cellSet  cellSet_body_conductor                                       new    pointToCell pointSet_body_conductor all
pointSet pointSet_body_conductor                                      remove 

pointSet pointSet_body_space                                          new    surfaceToPoint "constant/triSurface/geometry_body_space.stl" 0.0002 true false
cellSet  cellSet_body_space                                           new    pointToCell pointSet_body_space all
pointSet pointSet_body_space                                          remove 

pointSet pointSet_body_solid                                          new    surfaceToPoint "constant/triSurface/geometry_body_solid.stl" 0.0002 true false
cellSet  cellSet_body_solid                                           new    pointToCell pointSet_body_solid all
pointSet pointSet_body_solid                                          remove 

pointSet pointSet_body_coils                                          new    surfaceToPoint "constant/triSurface/geometry_body_coils.stl" 0.0002 true false
cellSet  cellSet_body_coils                                           new    pointToCell pointSet_body_coils all
pointSet pointSet_body_coils                                          remove 

pointSet pointSet_body_fluid                                          new    surfaceToPoint "constant/triSurface/geometry_body_fluid.stl" 0.0002 true false
cellSet  cellSet_body_fluid                                           new    pointToCell pointSet_body_fluid all
pointSet pointSet_body_fluid                                          remove 

pointSet pointSet_body_free                                           new    surfaceToPoint "constant/triSurface/geometry_body_free.stl" 0.0002 true false
cellSet  cellSet_body_free                                            new    pointToCell pointSet_body_free all
pointSet pointSet_body_free                                           remove 

pointSet pointSet_body_vessel                                         new    surfaceToPoint "constant/triSurface/geometry_body_vessel.stl" 0.0002 true false
cellSet  cellSet_body_vessel                                          new    pointToCell pointSet_body_vessel all
pointSet pointSet_body_vessel                                         remove 

pointSet pointSet_body_coil                                           new    surfaceToPoint "constant/triSurface/geometry_body_coil.stl" 0.0002 true false
cellSet  cellSet_body_coil                                            new    pointToCell pointSet_body_coil all
pointSet pointSet_body_coil                                           remove 

# Shells

pointSet pointSet_shell_topWall                                       new    surfaceToPoint "constant/triSurface/geometry_shell_topWall.stl" 0.0002 false false
faceSet  faceSet_shell_topWall                                        new    pointToFace pointSet_shell_topWall all
pointSet pointSet_shell_topWall                                       remove 

pointSet pointSet_shell_infinity                                      new    surfaceToPoint "constant/triSurface/geometry_shell_infinity.stl" 0.0002 false false
faceSet  faceSet_shell_infinity                                       new    pointToFace pointSet_shell_infinity all
pointSet pointSet_shell_infinity                                      remove 

pointSet pointSet_shell_back                                          new    surfaceToPoint "constant/triSurface/geometry_shell_back.stl" 0.0002 false false
faceSet  faceSet_shell_back                                           new    pointToFace pointSet_shell_back all
pointSet pointSet_shell_back                                          remove 

pointSet pointSet_shell_cornerWall                                    new    surfaceToPoint "constant/triSurface/geometry_shell_cornerWall.stl" 0.0002 false false
faceSet  faceSet_shell_cornerWall                                     new    pointToFace pointSet_shell_cornerWall all
pointSet pointSet_shell_cornerWall                                    remove 

pointSet pointSet_shell_bottomWall                                    new    surfaceToPoint "constant/triSurface/geometry_shell_bottomWall.stl" 0.0002 false false
faceSet  faceSet_shell_bottomWall                                     new    pointToFace pointSet_shell_bottomWall all
pointSet pointSet_shell_bottomWall                                    remove 

pointSet pointSet_shell_front                                         new    surfaceToPoint "constant/triSurface/geometry_shell_front.stl" 0.0002 false false
faceSet  faceSet_shell_front                                          new    pointToFace pointSet_shell_front all
pointSet pointSet_shell_front                                         remove 

pointSet pointSet_shell_sideWall                                      new    surfaceToPoint "constant/triSurface/geometry_shell_sideWall.stl" 0.0002 false false
faceSet  faceSet_shell_sideWall                                       new    pointToFace pointSet_shell_sideWall all
pointSet pointSet_shell_sideWall                                      remove 

# Regions

cellSet  cellSet_region_fluid                                         new    
cellSet  cellSet_region_fluid                                         add    setToCell cellSet_body_fluid

cellSet  cellSet_region_buffer                                        new    

cellSet  cellSet_region_static                                        new    
cellSet  cellSet_region_static                                        add    setToCell cellSet_region_fluid
cellSet  cellSet_region_static                                        add    setToCell cellSet_region_buffer
cellSet  cellSet_region_static                                        invert 

cellSet  cellSet_region_conductor                                     new    
cellSet  cellSet_region_conductor                                     add    setToCell cellSet_body_fluid
cellSet  cellSet_region_conductor                                     add    setToCell cellSet_body_solid
cellSet  cellSet_region_conductor                                     add    setToCell cellSet_body_heater

cellSet  cellSet_region_space                                         new    
cellSet  cellSet_region_space                                         add    setToCell cellSet_region_conductor
cellSet  cellSet_region_space                                         invert 

faceSet  faceSet_regions0                                             new    
faceSet  faceSet_regions0                                             add    cellToFace cellSet_region_fluid all
faceSet  faceSet_regions0                                             delete cellToFace cellSet_region_fluid both
faceSet  faceSet_regions1                                             new    
faceSet  faceSet_regions1                                             add    cellToFace cellSet_region_buffer all
faceSet  faceSet_regions1                                             delete cellToFace cellSet_region_buffer both
faceSet  faceSet_regions2                                             new    
faceSet  faceSet_regions2                                             add    cellToFace cellSet_region_static all
faceSet  faceSet_regions2                                             delete cellToFace cellSet_region_static both
faceSet  faceSet_regions3                                             new    
faceSet  faceSet_regions3                                             add    cellToFace cellSet_region_conductor all
faceSet  faceSet_regions3                                             delete cellToFace cellSet_region_conductor both
faceSet  faceSet_regions4                                             new    
faceSet  faceSet_regions4                                             add    cellToFace cellSet_region_space all
faceSet  faceSet_regions4                                             delete cellToFace cellSet_region_space both
faceSet  faceSet_regions5                                             new    
faceSet  faceSet_regions5                                             add    cellToFace cellSet_all all
faceSet  faceSet_regions5                                             delete cellToFace cellSet_all both

faceSet  faceSet_regions                                              new    
faceSet  faceSet_regions                                              add    setToFace faceSet_regions0
faceSet  faceSet_regions                                              add    setToFace faceSet_regions1
faceSet  faceSet_regions                                              add    setToFace faceSet_regions2
faceSet  faceSet_regions                                              add    setToFace faceSet_regions3
faceSet  faceSet_regions                                              add    setToFace faceSet_regions4
faceSet  faceSet_regions                                              delete setToFace faceSet_regions5

faceSet  faceSet_regions0                                             remove 
faceSet  faceSet_regions1                                             remove 
faceSet  faceSet_regions2                                             remove 
faceSet  faceSet_regions3                                             remove 
faceSet  faceSet_regions4                                             remove 
faceSet  faceSet_regions5                                             remove 

# Patches

faceSet  faceSet_patch_front                                          new    
faceSet  faceSet_patch_front                                          add    setToFace faceSet_shell_front

faceSet  faceSet_patch_back                                           new    
faceSet  faceSet_patch_back                                           add    setToFace faceSet_shell_back

faceSet  faceSet_patch_infinity                                       new    
faceSet  faceSet_patch_infinity                                       add    setToFace faceSet_shell_infinity

faceSet  faceSet_patch_topWall                                        new    
faceSet  faceSet_patch_topWall                                        add    setToFace faceSet_shell_topWall

faceSet  faceSet_patch_sideWall                                       new    
faceSet  faceSet_patch_sideWall                                       add    setToFace faceSet_shell_sideWall

faceSet  faceSet_patch_cornerWall                                     new    
faceSet  faceSet_patch_cornerWall                                     add    setToFace faceSet_shell_cornerWall

faceSet  faceSet_patch_bottomWall                                     new    
faceSet  faceSet_patch_bottomWall                                     add    setToFace faceSet_shell_bottomWall

# Materials

cellSet  cellSet_material_siliconLiquid                               new    
cellSet  cellSet_material_siliconLiquid                               add    setToCell cellSet_body_fluid

cellSet  cellSet_material_siliconSolid                                new    
cellSet  cellSet_material_siliconSolid                                add    setToCell cellSet_body_solid

cellSet  cellSet_material_graphite                                    new    
cellSet  cellSet_material_graphite                                    add    setToCell cellSet_body_heater

cellSet  cellSet_material_air                                         new    
cellSet  cellSet_material_air                                         add    setToCell cellSet_body_space

# End

quit
